app/controllers/cities_controller.rb

  def index

    if params[:q]
      @cities = City.search(params[:q])
---
SELECT * FROM `cities` WHERE (name LIKE '%An%') ORDER BY name ASC