app/controllers/distributions_controller.rb

  def search
#    simply render the search.html page
#    put all this in the index action and remove the mapping from the routes.rb
# => for the search by date, put it in the model
    if params[:date]
      date = params[:date]
      str_date = date[:year] + '-'  + date[:month] + '-' + date[:day]
      @distributions = Distribution.search(str_date)
---
SELECT * FROM `distributions` WHERE (date = '2010-1-3') ORDER BY foyer_id ASC

  def show
    @distribution = @foyer.distributions.find(params[:id])
---
SELECT * FROM `distributions` WHERE (`distributions`.`id` = 12 AND (`distributions`.foyer_id = 10))

  def edit
    @distribution = @foyer.distributions.find(params[:id])
---
SELECT * FROM `distributions` WHERE (`distributions`.`id` = 13 AND (`distributions`.foyer_id = 11))

  def create

    @distribution = @foyer.distributions.build(params[:distribution])

    respond_to do |format|
      if @distribution.save
---
INSERT INTO `distributions` (`created_at`, `donation_bras_ouverts`, `updated_at`, `dette`, `date`, `foyer_id`, `prix`, `nombre_distribue`, `element_id`) VALUES('2010-01-02 17:42:38', 0, '2010-01-02 17:42:38', 0.0, '2010-01-02', NULL, 1.0, 1, NULL)

  def destroy
    flash[:notice] = 'Distribution a bien été suprimée.'
    @distribution = Distribution.find(params[:id])
    @distribution.destroy
---
SELECT * FROM `distributions` WHERE (`distributions`.`id` = 10)
DELETE FROM `distributions` WHERE `id` = 10

  def find_foyer
    @foyer = Foyer.find(params[:foyer_id])
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 11)