app/controllers/foyers_controller.rb

  def index

    search = ""

    if params[:foyer] != nil
      search = params[:foyer][:chef_nom]
    end

    @foyers = Foyer.find(:all, :conditions => ['chef_nom LIKE ?', "%#{search}%"], :order => "chef_nom ASC")
---
SELECT * FROM `foyers` WHERE (chef_nom LIKE '%%') ORDER BY chef_nom DESC

  def show
    @foyer = Foyer.find(params[:id])
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 1)

  def edit
    @foyer = Foyer.find(params[:id])
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 1)

  def create
    @foyer = Foyer.new(params[:foyer])

    respond_to do |format|
      if @foyer.save
---
INSERT INTO `foyers` (`adresse_rue`, `adresse_additionel`, `created_at`, `inscription_complete`, `adresse_code_postal`, `telephone_portable`, `telephone_fixe`, `dette_cumule`, `adresse_numero`, `adresse_chez`, `updated_at`, `chef_sex`, `chef_date_naissance`, `handicape`, `diabetique`, `chef_prenom`, `hallal`, `situation_familiale`, `nbr_membres_adultes`, `lettre_AS`, `nbr_membres_enfants`, `nbr_colis_a_distribuer`, `sans_porc`, `nbr_membres`, `chef_nom`, `sdf`, `demandeur_asile`) VALUES('avenue de Cannes', 'Résidence Antibes les Pins - Entrée D - Juan les Pins', '2009-12-11 20:22:42', 1, '06160', '06 28 81 35 14', '04 93 33 05 58', 0.0, '55', '', '2009-12-11 20:22:42', 'm', '2009-12-11', 0, 0, 'Leonardo', 0, 'concubinage', 2, 0, 0, 1, 0, 2, 'FREITAS GOMES', 0, 0)

  def update
    @foyer = Foyer.find(params[:id])

    respond_to do |format|
      if @foyer.update_attributes(params[:foyer])
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 1)
UPDATE `foyers` SET `updated_at` = '2009-12-15 22:52:51', `nbr_colis_a_distribuer` = 1, `inscription_complete` = 1, `nbr_membres_enfants` = 2, `nbr_membres_adultes` = 5, `situation_familiale` = 'marie', `dette_cumule` = 0.0 WHERE `id` = 4

  def destroy
    @foyer = Foyer.find(params[:id])
    @foyer.destroy
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 2)
DELETE FROM `foyers` WHERE `id` = 2