app/controllers/membres_controller.rb

  def show
    @membre = @foyer.membres.find(params[:id])
---
SELECT * FROM `membres` WHERE (`membres`.`id` = 2 AND (`membres`.foyer_id = 1))

  def edit
    @membre = @foyer.membres.find(params[:id])
---
SELECT * FROM `membres` WHERE (`membres`.`id` = 3 AND (`membres`.foyer_id = 1))

  def create
    @membre = @foyer.membres.build(params[:membre])

    respond_to do |format|
      if @membre.save
---
INSERT INTO `membres` (`prenom`, `nom`, `created_at`, `updated_at`, `date_de_naissance`, `relation`, `foyer_id`, `sexe`) VALUES('Ana Claudia', 'Pizzutti', '2009-12-23 21:17:24', '2009-12-23 21:17:24', '1983-10-02', 'Epouse', 1, 'F')

  def update
    @membre = @foyer.membres.find(params[:id])

    respond_to do |format|
      if @membre.update_attributes(params[:membre])
---
SELECT * FROM `membres` WHERE (`membres`.`id` = 3 AND (`membres`.foyer_id = 1))
UPDATE `membres` SET `updated_at` = '2009-12-23 23:15:25', `prenom` = 'Pedro' WHERE `id` = 6

  def destroy
    @membre = @foyer.membres.find(params[:id])
    @membre.destroy
---
SELECT * FROM `membres` WHERE (`membres`.`id` = 2 AND (`membres`.foyer_id = 1))
DELETE FROM `membres` WHERE `id` = 2

  def find_foyer
    @foyer = Foyer.find(params[:foyer_id])
---
SELECT * FROM `foyers` WHERE (`foyers`.`id` = 1)